Autodesk.Revit.DB.Architecture.StairsPathDirection
The direction style of stairs path.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathDirection.AutomaticUpDown
The direction of the stair path will be determined automatically.

Autodesk.Revit.DB.Architecture.StairsPathDirection.AlwaysUp
The direction of the stair path will always be UP direction.